{
    "clubsData": [
      {
        "name": "Alumni Relation Committee",
        "img": "https://res.cloudinary.com/dlk5kntmy/image/upload/v1747502264/Alumni_Relation_mp5xrs.png",
        "link": "/club/Alumni",
        "description": "The Alumni Relation Committee is a platform for students to learn and practice alumni relation. It is a place where students can come together to learn and grow. It is a place where students can come together to learn and grow."
      },
      {
        "name": "Coding Club",
        "img": "https://res.cloudinary.com/dlk5kntmy/image/upload/v1747502249/Coding_club_ed2sbh.png",
        "link": "/club/coding",
        "description": "The Coding Club is a platform for students to learn and practice coding. It is a place where students can come together to learn and grow. It is a place where students can come together to learn and grow."
      },
      {
        "name": "Cultural & Event Cell",
        "img": "https://res.cloudinary.com/dlk5kntmy/image/upload/v1747502266/CULTURAL_EvENT_abnyuq.png",
        "link": "/club/Cultural",
        "description": "The Cultural & Event Cell is a platform for students to learn and practice cultural technology. It is a place where students can come together to learn and grow. It is a place where students can come together to learn and grow."
      },
      {
        "name": "Cyber Cop Cell",
        "img": "https://res.cloudinary.com/dlk5kntmy/image/upload/v1747502250/cyber_COP_npmtvn.png",
        "link": "/club/cyberCop",
        "description": "The Cyber Cop Cell is a platform for students to learn and practice cyber security. It is a place where students can come together to learn and grow. It is a place where students can come together to learn and grow."
      },
      {
        "name": "Dance Society",
        "img": "https://res.cloudinary.com/dlk5kntmy/image/upload/v1747502250/DAnce_Club_s5g6df.png",
        "link": "/club/Dance",
        "description": "The Dance Society is a platform for students to learn and practice dance. It is a place where students can come together to learn and grow. It is a place where students can come together to learn and grow."
      },
      {
        "name": "ELITE (Excellence & Leadership in Integrity, Tact, and Ethics)",
        "img": "https://res.cloudinary.com/dlk5kntmy/image/upload/v1747502251/DISCIpLINE_jt8ej5.png",
        "link": "/club/Disipline",
        "description": "ELITE is a platform for students to learn and practice discipline and leadership. It is a place where students can come together to learn and grow. It is a place where students can come together to learn and grow."
      },
      {
        "name": "Drone Society",
        "img": "https://res.cloudinary.com/dlk5kntmy/image/upload/v1747502267/DRONE_SOCIETY_ugfbt4.png",
        "link": "/club/drone",
        "description": "The Drone Society is a platform for students to learn and practice drone technology. It is a place where students can come together to learn and grow. It is a place where students can come together to learn and grow."
      },
      {
        "name": "E.V. Club",
        "img": "https://res.cloudinary.com/dlk5kntmy/image/upload/v1747502268/EV_g2djgp.png",
        "link": "/club/EV",
        "description": "The E.V. Club is a platform for students to learn and practice EV technology. It is a place where students can come together to learn and grow. It is a place where students can come together to learn and grow."
      },
      {
        "name": "Environment Club",
        "img": "https://res.cloudinary.com/dlk5kntmy/image/upload/v1747502261/RENEwAbLE_ENERGY_x7mjft.png",
        "link": "/club/Environment",
        "description": "The Environment Club is a platform for students to learn and practice environmental sustainability. It is a place where students can come together to learn and grow. It is a place where students can come together to learn and grow."
      },
      {
        "name": "Entrepreneurship Cell",
        "img": "https://res.cloudinary.com/dlk5kntmy/image/upload/v1747502252/ENTREpRENEURSHIp_weamnu.png",
        "link": "/club/entrepreneurship",
        "description": "The Entrepreneurship Cell is a platform for students to learn and practice entrepreneurship. It is a place where students can come together to learn and grow. It is a place where students can come together to learn and grow."
      },
      {
        "name": "IEEE Student Chapter",
        "img": "https://res.cloudinary.com/dlk5kntmy/image/upload/v1747502254/IEEE_Student_Chapter_tzqiza.png",
        "link": "/club/IEEE",
        "description": "The IEEE Student Chapter is a platform for students to learn and practice IEEE. It is a place where students can come together to learn and grow. It is a place where students can come together to learn and grow."
      },
      {
        "name": "Literary Club",
        "img": "https://res.cloudinary.com/dlk5kntmy/image/upload/v1747502256/LITERARY_Club_ooakhl.png",
        "link": "/club/Literary",
        "description": "The Literary Club is a platform for students to learn and practice literature. It is a place where students can come together to learn and grow. It is a place where students can come together to learn and grow."
      },
      {
        "name": "Media Fusion Society",
        "img": "https://res.cloudinary.com/dlk5kntmy/image/upload/v1747502257/Media_Fusion_vhlhjp.png",
        "link": "/club/media",
        "description": "The Media Fusion Society is a platform for students to learn and practice media technology. It is a place where students can come together to learn and grow. It is a place where students can come together to learn and grow."
      },
      {
        "name": "Music Society",
        "img": "https://res.cloudinary.com/dlk5kntmy/image/upload/v1747502258/mUSIC_SOCIETY_m2wmom.png",
        "link": "/club/music",
        "description": "The Music Society is a platform for students to learn and practice music. It is a place where students can come together to learn and grow. It is a place where students can come together to learn and grow."
      },
      {
        "name": "NSS Unit",
        "img": "https://res.cloudinary.com/dlk5kntmy/image/upload/v1747502258/mUSIC_SOCIETY_m2wmom.png",
        "link": "/club/nss",
        "description": "The NSS Unit is a platform for students to learn and practice social service. It is a place where students can come together to learn and grow. It is a place where students can come together to learn and grow."
      },
      {
        "name": "Renewable Energy Club",
        "img": "https://res.cloudinary.com/dlk5kntmy/image/upload/v1747502261/RENEwAbLE_ENERGY_x7mjft.png",
        "link": "/club/Renewable",
        "description": "The Renewable Energy Club is a platform for students to learn and practice renewable energy. It is a place where students can come together to learn and grow. It is a place where students can come together to learn and grow."
      },
      {
        "name": "Robotics Club",
        "img": "https://res.cloudinary.com/dlk5kntmy/image/upload/v1747502262/RObOTICS_CLUB_zuu4q1.png",
        "link": "/club/Robotics",
        "description": "The Robotics Club is a platform for students to learn and practice robotics. It is a place where students can come together to learn and grow. It is a place where students can come together to learn and grow."
      },
      {
        "name": "Tech Wizard Club",
        "img": "https://res.cloudinary.com/dlk5kntmy/image/upload/v1747502263/Tech_WIZARDs_obkby8.png",
        "link": "/club/Tech",
        "description": "The Tech Wizard Club is a platform for students to learn and practice tech. It is a place where students can come together to learn and grow. It is a place where students can come together to learn and grow."
      },
      {
        "name": "WINGS (Women Inspiring Growth & Success)",
        "img": "https://res.cloudinary.com/dlk5kntmy/image/upload/v1747502263/Tech_WIZARDs_obkby8.png",
        "link": "/club/WINGS",
        "description": "WINGS is a platform for women to inspire growth and success. It is a place where students can come together to learn and grow. It is a place where students can come together to learn and grow."
      }
    ]
  }
  